{
    "Abbie Falls": "This is Abbie Falls 2025,\nWith that heavy shit.\nI wanna see some blood,\nI wanna see violence,\nI wanna see some ajpjqwhigiopewahoighwoeigúhioawgeawgaw",
    "Baikal": "Even Structure. Zanger heeft nieuw project, maar ze hebben de release van hun content denk ik verkeerd getimed om echt iets van hype te creëren op Euroblast. Live is deze man altijd erg goed dus ik sta open om fan te worden.",
    "Benthos": "Bas: The Hirsch Effekt vibes, best wel leuk. All over the place qua genres. Mathy, jazzy, maar ook wat refreintjes hier en daar. \n\nEric: Leprous/Cynic achtig hier en daar, wel veel variatie in nummers dus dat kan live alle kanten op. Heel veel flanger/chorus gitaartjes.",
    "vianova": "Uh yaya. Meme uitstraling maar stiekem toch wel heel progressief voor metalcore met breakdowns. Misschien wel de band waar ik het meest hype voor ben dit jaar.",
    "Cevret": "Noem ze Steve Aoki want zo’n beetje elk nummer is een collab. Te weinig content voor een echte review, maar ik verwacht Intervals-achtige instrumentaliteit.",
    "Burden to Atlas": "Slecht geproduceerde female-fronted prog. Klinkt als Lacuna Coil / Nightwish die haar stem kwijt is. Ik pas.",
    "Dream State": "Emotionele catchy metalcore. Paramore met screams is wat te kort door de bocht (“we’re, better than that”), het laatste album heb ik vaak opgezet afgelopen tijd. Lekkere emo spoken word stukjes hier en daar, ben benieuwd.",
    "Dvne": "Voor the Ocean / Katatonia liefhebbers met hier en daar wat hardere elementen. Live was dit heel goed, de nummers van het latere album zijn wat catchier (Eleonora). Grootste schok voor mij was dat de zanger Frans was en niet Schots zoals de rest.",
    "IHLO": "Dit wás altijd Tesseract worship, maar behalve de zanger heeft de rest van de band nu wat meer een eigen sound. Zang is nog meer Danneract geworden, de rest een beetje Arcane Roots / synth-achtig hier en daar? Blijft wat soft, maar vast leuk.",
    "Isbjörg": "Gedegradeerd naar de kelder, maar wel een van de albums die ik het meest heb geluisterd dit jaar. Maatsoorten die gek zijn maar nooit overdreven, elk nummer is catchy, en het album heeft mooie terugkerende motiefjes in de pianodelen. Het enige dat mis kan gaan is de cleanzang.",
    "Night Verses": "Drummerman mag de show weer maken wat mij betreft. Nieuwe album heeft in zo'n beetje elk nummer wel een mooie drop, dat zal live wel hard gaan. ",
    "No Oath": "Ik kon hier zelf heel slecht naar luisteren door dat gekke electronische effect over de gitaar, maar de ratings zeggen dat we hier heen gaan, dus let's go. Staat nog main-stage ook.",
    "Ron Minis": "Man heeft een piano en een blauwe baard en speelt prog met een live drummer. Recipe for Euroblast success volgens mij. Als je Tigran Hamasyan kent, of Animals as Leaders op een piano leuk vindt, moet dit ook wel goedkomen.",
    "SENNA": "Hé, zo heet de hond van m'n oom ook. Leuke middle of the pack moderne metalcore, viel me erg mee als vervangende band. kelderstage en rond etenstijd, maar denk ik wel de moeite waard.",
    "The Intersphere": "Dit is de 'normaalste' muziek die dit jaar optreedt denk ik, door de clean vocals en simpele songstructuur. Lijkt soms wel verdacht veel op nummers van Port Noir / Rendezvous Point. In vorige edities waren dit soort bands ineens live heel cool, dus ik laat me verrassen.",
    "Sunborn": "Northlane was toch vorige jaar? Zo'n band waarvan ik elke keer weer vergat wat voor muziek het was, en eigenlijk nog steeds geen enkel nummer goed van ken, maar volgens mij hoeft dat ook niet. Kijkt vast heerlijk weg met een Becks Lime.",
    "Slope": "Duitse Beastie Boys die somehow dan weer wel op het hoofdpodium staan. Ik denk niet dat ze de hele boel gaan afbreken (slope-n?) bij dit publiek, tenzij hun grunty nummers spelen. Het gegeven paard, dus het is een whatever voor mij.",
    "Monosphere": "Stiekem heb ik het Puppeteer album van deze band nog best vaak geluisterd na 2023 Euroblast, maar nu ze hun hele stijl hebben veranderd zullen ze die wel niet meer spelen. Het is nu tech-death met proggy clean interludes, ook niet gek. Ik ben wel bij.",
    "Intervals": "Ik had voor de aankondiging de laatste twee albums van Intervals niet meegekregen, maar ben nu toch wel weer hyped. Niet heel anders dan het oude spul, maar wel gewoon goed. En als ik de setlist mag geloven kunnen we Mata Hari verwachten, Pog",
    "Esoterica": "Hebben net een nieuw album uit, en dat klinkt tenminste ergens naar. Best wel traag en gevoelig, klinkt alsof ze Sleep Token heel leuk vinden. Theatraal met hier en daar een viooltje. ",
    "Distant Dream": "Een Poolse atmosferische instrumentale band in de categorie Tides from Nebula (ook Pools trouwens) en sleepmakeswaves. Prima achtergrondmuziek, maar je moet wel echt fan zijn als je tussen de twee headliners naar de kelder loopt hiervoor. ",
    "Second Horizon": "Instrumentale riffy prog met alleen een album uit 2017. Deed me wat denken aan Toska en Chimp Spanner, niet verkeerd. "
}