{
    "Anima Tempo": "Ik kan niet dealen met die clean vocals",
    "Avralize": "Lekkere djentcore met meezing refreintjes",
    "Consvumer": "Duitstalige thallcore? Gaat best hard",
    "ESSIGFABRIK ELECTRO PARTY": "Vergeet je extra jossie niet",
    "Floya": "Lekker stemmetje maar de nummers zijn hit or miss",
    "Jakub Zytecki": "Jakub Zzz-ytecki",
    "Kolari": "Pak je moshbroekje en oefen je two-step, we gaan hardcore dancen op EB!",
    "Northlane": "Ik weet het niet met die laatste paar albums, doe mij die oude zanger maar",
    "Novelists": "Wil dit wel zien, hebben meer ex-vocalisten dan albums volgens mij",
    "Ophelia Sullivan": "(!)",
    "OU": "Wil ik wel zien, klonk gek. Eric: Dit is alsof ze female prog singing over een bill wurtz video hebben gezet, youtube 'history of japan'",
    "ten56": "Lekker lomp, Diazepam is wel een banger",
    "Unprocessed": "Polyphiacore met vocals, veel hitjes ondertussen",
    "Vower": "Ex-Palm Reader maar klinkt feitelijke hetzelfde door mega herkenbare vocals, vind ik leuk",
    "WalzWerk": "Progressieve Schoonheid, orgasmus",
    "We Are Perspectives": "Gaan we heen. Het hele Heritage album luistert wel lekker door. Gratis pig squeels.",
    "Ayahuasca": "Volgens mij is dit wel eens eerder geweest in de kelder en gingen we nooit. Ik heb het nog een keer een kans gegeven, de ene nummers zijn heel standaard metalcore, en de anderen weer meer HLB achtig. Twijfel.",
    "As Living Arrows": "Post rock/post posthardcore/screamo vibes. Behoorlijk emotioneel gebeuren, wordt live of erg meeslepend of valt totaal weg. Wil ik wel heen",
    "Kardashev": "Kut ik moet nog dat nieuwe shirt bestellen",
    "Mnemic": "Dit is zo'n classic industrial band die ik nooit heb geluisterd, beetje à la Fear Factory enzo. Als je Car Bomb en vroege Meshuggah leuk vindt kom je hier ook wel in, maar volgens mij wordt dit eerder kijken dan herkennen.",
    "Naxen": "Token Black Metal band van dit jaar, saai en repetitief op een goeie manier, vind ik. Ga ik wel even bij staan.",
    "Trylion": "Poolse Prog-death? Vond het wel cool dit, veel 'dingetjes' voor een DM band. Beetje Letters from the Colony idee.",
    "Party Session Metal": "DJ Ent?",
    "Something or Other": "Dit klinkt als een indierock band waarvan de gitarist ook naar djent luistert, niet erg spannend.",
    "Cauldron": "Misery Signals worship/Trustkill Records style metalcore. Lekker chaotisch met een hoop panic chords, oftwel Bas approved.",
    "Pridian": "Ropzcore in de ochtend",
    "EUROBLAST FAMILY PHOTO": ""
}