{
    "Earthside": "",
    "Einar Solberg": "Omdat er nog niet genoeg leprous was op zaterdag ",
    "A Kews Tag": "Zonde dat dit niet mainstage is, maar dit wordt wel een eerste-rijtje voor mij. Luister het laatste album even twee keer en je kunt alles qua melodie meeblèren, niemand weet toch wat ie zegt.",
    "Feather Mountain": "Favorietje van Eric, gekke mix van Safety Fire gitaartjes en rustige emotionele stukjes. De hitjes staan in de playlist.",
    "GGGOLDDD": "Simpcore? Dit heeft schijnbaar ooit in Groningen gespeeld en heette Gold tot Goldband populair werd xD Voelt als een lime-lurk band, maar ik ben wel benieuwd.",
    "Atlas": "Dit was volgens mij onze Allt qua memecore voordat we dat kenden. This house, was built, on broken bones. Alles wat je moet weten volgens mij.",
    "Allt": "Dit album laat lang op zich wachten, maar tot die tijd hebben we Paralyzed als wekker. Andere nummers zijn ook leuk, ik zou wel aanraden dit wat in te luisteren omdat het mainstage staat. ",
    "Tiberius": "Protest the Hero op z'n Schots, pretty much. Heeft wel een beetje het risico dat dit een heel irritante zanger gaat zijn als ik het zo hoor. \n\nExtinctionrebellioncore",
    "This Will Destroy You": "Slaapmuziek, kan er niet zoveel anders van maken. Ik hoop dat dit live wat meer pakt dan op albums, want als het een uur lang ambient is ga ik liever bier drinken denk ik.",
    "Sextrow": "Addicted to rock! Hair metal / Aerosmith / Iron Maiden achtige parodie, dit wordt wel een feestje denk ik.",
    "Omnific": "Double bass slap combo, oh-em-gee. Dit album draai ik wel geregeld, dit laat zich gemakkelijk meeneuriën. Beetje Evan Brewers solo werk als dat je wat zegt. Bonuspunten omdat ze een nummer hebben genaamd Phat Mackerel, en een bandlid genaamd Matt Fack.",
    "Northern Lights": "Franse metalcore à la Novelists en Kadinja. Hopelijk kunnen we snel het coveralbum verwachten.",
    "Lucrecia": "(!)",
    "E.N.D.": "Dit is de verplichte oude-mannen-doen-Meshuggah band van dit jaar. Oude rockers die nog even een remastertje van 19-zoveel erin knallen. Beetje Car Bomb met matige vocals.",
    "Heart of a Coward": "22 september komt er een nieuw album uit met je boy Kaan, maar ik moet zeggen dat ik de oudere albums hiervan ook nog wel geregeld luister. Nieuwe singles zijn ook prima, dus misschien nog even snel een weekje inluisteren eind deze maand. ",
    "Hypno5e": "Deze band klinkt thuis altijd medium, maar is live een stuk harder dan je verwacht. Volgens mij hebben we dit al een keer op vijf (kunnen) zien, beetje huisbandje van EB. Laatste album is niet heel anders dan de rest van hun werk, verwacht wat Italiaans gemompel overal. Wil ik wel heen iig.",
    "Ice Sealed Eyes": "Omschrijft zichzelf als \"newcore\", haha. Loathe-achtig klopt wel, maar dit is kelderwerk op de eerste dag dus het is maar de vraag of we dit gaan zien. Zal wel lekker zweten worden.",
    "Playgrounded": "Deze band is beter dan de sneue woordgrap doet vermoeden. Goeie albumnaam ook, beetje in de categorie I've dealt with worse, but this is worse. Past goed bij The Ocean. Eén van de weinige bands van EB dit jaar die ik ook in andere posts etc. langs heb zien komen als hype.",
    "The Sleeper": "Dit is de meezingmetalcore band van dit jaar. Veel clean Erra stukjes in de refreinen, en soms wat Monuments-tapping, maar voor de rest best wel vergeetbaar.",
    "The Ocean": "Tsja, het nieuwe album is niet echt vol bangers ofzo, maar wel leuk. Ben benieuwd of het front-to-back wordt. Ik moet ook zeggen dat ik, alweer, het nummer met de gastvocalist het leukst vind, maar die kunnen we denk ik wel vergeten.",
    "R3v0": "(!) Female-fronted Steven Wilson prog. Aangezien ik Porcupine Tree laatste tijd veel opzet vind ik dit nu ook leuk. Het kan verkeren.",
    "The Hirsch Effekt": "Dit wordt per album raarder, maar live zullen we daar denk ik niet veel van merken. Release show van het album op het festival blijkbaar, maar ik hoop toch weer STEIN AUF STEIN te kunnen blèren."
}